ВЫБРАТЬ
  ВложенныйЗапрос.Номенклатура КАК Номенклатура,
  СУММА(ВложенныйЗапрос.Остаток) КАК Остаток,
  ВложенныйЗапрос.День КАК День
ИЗ
  (ВЫБРАТЬ
    СпрНоменклатура.Ссылка КАК Номенклатура,
    ВЫБОР
      КОГДА ТоварыНаСкладахОстаткиИОбороты.Период = &НачалоПериода
        ТОГДА ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток
      КОГДА ТоварыНаСкладахОстаткиИОбороты.Период <= Дни.День
        ТОГДА ТоварыНаСкладахОстаткиИОбороты.ВНаличииОборот
      ИНАЧЕ 0
    КОНЕЦ КАК Остаток,
    Дни.День КАК День
  ИЗ
    ВТ_Дни КАК Дни,
    Справочник.Номенклатура КАК СпрНоменклатура
      ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &ОкончаниеПериода, День) КАК ТоварыНаСкладахОстаткиИОбороты
      ПО (ТоварыНаСкладахОстаткиИОбороты.Номенклатура = СпрНоменклатура.Ссылка)) КАК ВложенныйЗапрос

СГРУППИРОВАТЬ ПО
  ВложенныйЗапрос.Номенклатура,
  ВложенныйЗапрос.День
