//////////////////
//ПЕРВЫЙ ВАРИАНТ 

// 1-ая группа
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель,
isnull(Элемент.Родитель, &ПустаяСсылкаРодителя))))))))))

// 2-ая группа
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель, &ПустаяСсылкаРодителя)))))))))

// 3-я группа
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель.Родитель,
isnull(Элемент.Родитель.Родитель.Родитель, &ПустаяСсылкаРодителя))))))))

//////////////////
//ВТОРОЙ ВАРИАНТ

// 1-ая группа
ВЫБОР
  КОГДА Элемент.Родитель = &ПустаяСсылкаРодителя
    ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
  КОГДА Элемент.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
КОНЕЦ

// 2-ая группа
ВЫБОР
  КОГДА Элемент.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
  КОГДА Элемент.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
КОНЕЦ
 

// 3-я группа
ВЫБОР
  КОГДА Элемент.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
  КОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &ПустаяСсылкаРодителя
    ТОГДА Элемент.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
КОНЕЦ
