// Универсальная процедура для вычисления оптимальной ширины колонок
// Нужна при выводе макета отчета вручную, чтобы значение не переносилось на следующую строчку
// Минмальная ширина колонки равна ширине колонки в шапке макета
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент, для которого нужно вычислить ширину колонок
//  НачалоТаблицыПослеШапки - Число, номер строки, с которой начинается основная часть таблицы
//  МаксШиринаКолонки - Число, после достижения данной ширины строка переместится на следующую строчку
//(если в выводимой области установлено свойство РазмещениеТекста в значение Переносить)
//
Процедура РасчетШириныКолонок(ТабличныйДокумент, НачалоТаблицыПослеШапки, МаксШиринаКолонки = 40)

	ВсегоПройти = (ТабличныйДокумент.ВысотаТаблицы - НачалоТаблицыПослеШапки + 1) * ТабличныйДокумент.ШиринаТаблицы;
	Счетчик = 1;
	Для Кол = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл

		ШиринаКолонки = 0;
		ШиринаПоУмолчанию = ТабличныйДокумент.Область("R"+Формат(НачалоТаблицыПослеШапки-1,"ЧГ=0")+"C"+Формат(Кол,"ЧГ=0")).ШиринаКолонки;

		//см. "Прогресс выполнения и состояние"
		ПоказатьПрогрессВыполнения(ВсегоПройти, Счетчик, "Расчет ширины колонок");
		ПерваяИтерация = Истина;

		Для Стр = НачалоТаблицыПослеШапки По ТабличныйДокумент.ВысотаТаблицы Цикл
           		
			Область = ТабличныйДокумент.Область("R"+Формат(Стр,"ЧГ=0")+"C"+Формат(Кол,"ЧГ=0"));
            		ШиринаОбласти = Область.Отступ+СтрДлина(СокрЛП(Область.Текст))+1.5;
            		ШиринаКолонки = Макс(ШиринаКолонки, ШиринаОбласти, ШиринаПоУмолчанию);
            		
			Если ШиринаКолонки > МаксШиринаКолонки Тогда
                		Область.ШиринаКолонки = МаксШиринаКолонки;
            		Иначе
               			Область.ШиринаКолонки = ШиринаКолонки;
			КонецЕсли;

			Если НЕ ПерваяИтерация Тогда
				//см. "Прогресс выполнения и состояние"
				ПоказатьПрогрессВыполнения(ВсегоПройти, Счетчик, "Расчет ширины колонок");
			КонецЕсли;

			ПерваяИтерация = Ложь;

		Конеццикла;

    КонецЦикла;

КонецПроцедуры
